GopalSaraf/Practicals/PSDL/include/proc/pic16lf1788.inc
// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
DAC1CON0                                 equ 0118h
// bitfield definitions
DAC1CON0_DAC1NSS_POSN                    equ 0000h
DAC1CON0_DAC1NSS_POSITION                equ 0000h
DAC1CON0_DAC1NSS_SIZE                    equ 0001h
DAC1CON0_DAC1NSS_LENGTH                  equ 0001h
DAC1CON0_DAC1NSS_MASK                    equ 0001h
DAC1CON0_DAC1PSS_POSN                    equ 0002h
DAC1CON0_DAC1PSS_POSITION                equ 0002h
DAC1CON0_DAC1PSS_SIZE                    equ 0002h
DAC1CON0_DAC1PSS_LENGTH                  equ 0002h
DAC1CON0_DAC1PSS_MASK                    equ 000Ch
DAC1CON0_DAC1OE2_POSN                    equ 0004h
DAC1CON0_DAC1OE2_POSITION                equ 0004h
DAC1CON0_DAC1OE2_SIZE                    equ 0001h
DAC1CON0_DAC1OE2_LENGTH                  equ 0001h
DAC1CON0_DAC1OE2_MASK                    equ 0010h
DAC1CON0_DAC1OE1_POSN                    equ 0005h
DAC1CON0_DAC1OE1_POSITION                equ 0005h
DAC1CON0_DAC1OE1_SIZE                    equ 0001h
DAC1CON0_DAC1OE1_LENGTH                  equ 0001h
DAC1CON0_DAC1OE1_MASK                    equ 0020h
DAC1CON0_DAC1EN_POSN                     equ 0007h
DAC1CON0_DAC1EN_POSITION                 equ 0007h
DAC1CON0_DAC1EN_SIZE                     equ 0001h
DAC1CON0_DAC1EN_LENGTH                   equ 0001h
DAC1CON0_DAC1EN_MASK                     equ 0080h
DAC1CON0_DAC1PSS0_POSN                   equ 0002h
DAC1CON0_DAC1PSS0_POSITION               equ 0002h
DAC1CON0_DAC1PSS0_SIZE                   equ 0001h
DAC1CON0_DAC1PSS0_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS0_MASK                   equ 0004h
DAC1CON0_DAC1PSS1_POSN                   equ 0003h
DAC1CON0_DAC1PSS1_POSITION               equ 0003h
DAC1CON0_DAC1PSS1_SIZE                   equ 0001h
DAC1CON0_DAC1PSS1_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS1_MASK                   equ 0008h
DAC1CON0_DACNSS_POSN                     equ 0000h
DAC1CON0_DACNSS_POSITION                 equ 0000h
DAC1CON0_DACNSS_SIZE                     equ 0001h
DAC1CON0_DACNSS_LENGTH                   equ 0001h
DAC1CON0_DACNSS_MASK                     equ 0001h
DAC1CON0_DACPSS_POSN                     equ 0002h
DAC1CON0_DACPSS_POSITION                 equ 0002h
DAC1CON0_DACPSS_SIZE                     equ 0002h
DAC1CON0_DACPSS_LENGTH                   equ 0002h
DAC1CON0_DACPSS_MASK                     equ 000Ch
DAC1CON0_DACOE0_POSN                     equ 0004h
DAC1CON0_DACOE0_POSITION                 equ 0004h
DAC1CON0_DACOE0_SIZE                     equ 0001h
DAC1CON0_DACOE0_LENGTH                   equ 0001h
DAC1CON0_DACOE0_MASK                     equ 0010h
DAC1CON0_DACOE1_POSN                     equ 0005h
DAC1CON0_DACOE1_POSITION                 equ 0005h
DAC1CON0_DACOE1_SIZE                     equ 0001h
DAC1CON0_DACOE1_LENGTH                   equ 0001h
DAC1CON0_DACOE1_MASK                     equ 0020h
DAC1CON0_DACEN_POSN                      equ 0007h
DAC1CON0_DACEN_POSITION                  equ 0007h
DAC1CON0_DACEN_SIZE                      equ 0001h
DAC1CON0_DACEN_LENGTH                    equ 0001h
DAC1CON0_DACEN_MASK                      equ 0080h
DAC1CON0_DACPSS0_POSN                    equ 0002h
DAC1CON0_DACPSS0_POSITION                equ 0002h
DAC1CON0_DACPSS0_SIZE                    equ 0001h
DAC1CON0_DACPSS0_LENGTH                  equ 0001h
DAC1CON0_DACPSS0_MASK                    equ 0004h
DAC1CON0_DACPSS1_POSN                    equ 0003h
DAC1CON0_DACPSS1_POSITION                equ 0003h
DAC1CON0_DACPSS1_SIZE                    equ 0001h
DAC1CON0_DACPSS1_LENGTH                  equ 0001h
DAC1CON0_DACPSS1_MASK                    equ 0008h

// Register: DAC1CON1
#define DAC1CON1 DAC1CON1
DAC1CON1                                 equ 0119h
// bitfield definitions
DAC1CON1_DAC1R_POSN                      equ 0000h
DAC1CON1_DAC1R_POSITION                  equ 0000h
DAC1CON1_DAC1R_SIZE                      equ 0008h
DAC1CON1_DAC1R_LENGTH                    equ 0008h
DAC1CON1_DAC1R_MASK                      equ 00FFh
DAC1CON1_DAC1R0_POSN                     equ 0000h
DAC1CON1_DAC1R0_POSITION                 equ 0000h
DAC1CON1_DAC1R0_SIZE                     equ 0001h
DAC1CON1_DAC1R0_LENGTH                   equ 0001h
DAC1CON1_DAC1R0_MASK                     equ 0001h
DAC1CON1_DAC1R1_POSN                     equ 0001h
DAC1CON1_DAC1R1_POSITION                 equ 0001h
DAC1CON1_DAC1R1_SIZE                     equ 0001h
DAC1CON1_DAC1R1_LENGTH                   equ 0001h
DAC1CON1_DAC1R1_MASK                     equ 0002h
DAC1CON1_DAC1R2_POSN                     equ 0002h
DAC1CON1_DAC1R2_POSITION                 equ 0002h
DAC1CON1_DAC1R2_SIZE                     equ 0001h
DAC1CON1_DAC1R2_LENGTH                   equ 0001h
DAC1CON1_DAC1R2_MASK                     equ 0004h
DAC1CON1_DAC1R3_POSN                     equ 0003h
DAC1CON1_DAC1R3_POSITION                 equ 0003h
DAC1CON1_DAC1R3_SIZE                     equ 0001h
DAC1CON1_DAC1R3_LENGTH                   equ 0001h
DAC1CON1_DAC1R3_MASK                     equ 0008h
DAC1CON1_DAC1R4_POSN                     equ 0004h
DAC1CON1_DAC1R4_POSITION                 equ 0004h
DAC1CON1_DAC1R4_SIZE                     equ 0001h
DAC1CON1_DAC1R4_LENGTH                   equ 0001h
DAC1CON1_DAC1R4_MASK                     equ 0010h
DAC1CON1_DAC1R5_POSN                     equ 0005h
DAC1CON1_DAC1R5_POSITION                 equ 0005h
DAC1CON1_DAC1R5_SIZE                     equ 0001h
DAC1CON1_DAC1R5_LENGTH                   equ 0001h
DAC1CON1_DAC1R5_MASK                     equ 0020h
DAC1CON1_DAC1R6_POSN                     equ 0006h
DAC1CON1_DAC1R6_POSITION                 equ 0006h
DAC1CON1_DAC1R6_SIZE                     equ 0001h
DAC1CON1_DAC1R6_LENGTH                   equ 0001h
DAC1CON1_DAC1R6_MASK                     equ 0040h
DAC1CON1_DAC1R7_POSN                     equ 0007h
DAC1CON1_DAC1R7_POSITION                 equ 0007h
DAC1CON1_DAC1R7_SIZE                     equ 0001h
DAC1CON1_DAC1R7_LENGTH                   equ 0001h
DAC1CON1_DAC1R7_MASK                     equ 0080h
DAC1CON1_DACR0_POSN                      equ 0000h
DAC1CON1_DACR0_POSITION                  equ 0000h
DAC1CON1_DACR0_SIZE                      equ 0001h
DAC1CON1_DACR0_LENGTH                    equ 0001h
DAC1CON1_DACR0_MASK                      equ 0001h
DAC1CON1_DACR1_POSN                      equ 0001h
DAC1CON1_DACR1_POSITION                  equ 0001h
DAC1CON1_DACR1_SIZE                      equ 0001h
DAC1CON1_DACR1_LENGTH                    equ 0001h
DAC1CON1_DACR1_MASK                      equ 0002h
DAC1CON1_DACR2_POSN                      equ 0002h
DAC1CON1_DACR2_POSITION                  equ 0002h
DAC1CON1_DACR2_SIZE                      equ 0001h
DAC1CON1_DACR2_LENGTH                    equ 0001h
DAC1CON1_DACR2_MASK                      equ 0004h
DAC1CON1_DACR3_POSN                      equ 0003h
DAC1CON1_DACR3_POSITION                  equ 0003h
DAC1CON1_DACR3_SIZE                      equ 0001h
DAC1CON1_DACR3_LENGTH                    equ 0001h
DAC1CON1_DACR3_MASK                      equ 0008h
DAC1CON1_DACR4_POSN                      equ 0004h
DAC1CON1_DACR4_POSITION                  equ 0004h
DAC1CON1_DACR4_SIZE                      equ 0001h
DAC1CON1_DACR4_LENGTH                    equ 0001h
DAC1CON1_DACR4_MASK                      equ 0010h
DAC1CON1_DACR5_POSN                      equ 0005h
DAC1CON1_DACR5_POSITION                  equ 0005h
DAC1CON1_DACR5_SIZE                      equ 0001h
DAC1CON1_DACR5_LENGTH                    equ 0001h
DAC1CON1_DACR5_MASK                      equ 0020h
DAC1CON1_DACR6_POSN                      equ 0006h
DAC1CON1_DACR6_POSITION                  equ 0006h
DAC1CON1_DACR6_SIZE                      equ 0001h
DAC1CON1_DACR6_LENGTH                    equ 0001h
DAC1CON1_DACR6_MASK                      equ 0040h
DAC1CON1_DACR7_POSN                      equ 0007h
DAC1CON1_DACR7_POSITION                  equ 0007h
DAC1CON1_DACR7_SIZE                      equ 0001h
DAC1CON1_DACR7_LENGTH                    equ 0001h
DAC1CON1_DACR7_MASK                      equ 0080h

// Register: CM4CON0
#define CM4CON0 CM4CON0
CM4CON0                                  equ 011Ah
// bitfield definitions
CM4CON0_C4SYNC_POSN                      equ 0000h
CM4CON0_C4SYNC_POSITION                  equ 0000h
CM4CON0_C4SYNC_SIZE                      equ 0001h
CM4CON0_C4SYNC_LENGTH                    equ 0001h
CM4CON0_C4SYNC_MASK                      equ 0001h
CM4CON0_C4HYS_POSN                       equ 0001h
CM4CON0_C4HYS_POSITION                   equ 0001h
CM4CON0_C4HYS_SIZE                       equ 0001h
CM4CON0_C4HYS_LENGTH                     equ 0001h
CM4CON0_C4HYS_MASK                       equ 0002h
CM4CON0_C4SP_POSN                        equ 0002h
CM4CON0_C4SP_POSITION                    equ 0002h
CM4CON0_C4SP_SIZE                        equ 0001h
CM4CON0_C4SP_LENGTH                      equ 0001h
CM4CON0_C4SP_MASK                        equ 0004h
CM4CON0_C4ZLF_POSN                       equ 0003h
CM4CON0_C4ZLF_POSITION                   equ 0003h
CM4CON0_C4ZLF_SIZE                       equ 0001h
CM4CON0_C4ZLF_LENGTH                     equ 0001h
CM4CON0_C4ZLF_MASK                       equ 0008h
CM4CON0_C4POL_POSN                       equ 0004h
CM4CON0_C4POL_POSITION                   equ 0004h
CM4CON0_C4POL_SIZE                       equ 0001h
CM4CON0_C4POL_LENGTH                     equ 0001h
CM4CON0_C4POL_MASK                       equ 0010h
CM4CON0_C4OE_POSN                        equ 0005h
CM4CON0_C4OE_POSITION                    equ 0005h
CM4CON0_C4OE_SIZE                        equ 0001h
CM4CON0_C4OE_LENGTH                      equ 0001h
CM4CON0_C4OE_MASK                        equ 0020h
CM4CON0_C4OUT_POSN                       equ 0006h
CM4CON0_C4OUT_POSITION                   equ 0006h
CM4CON0_C4OUT_SIZE                       equ 0001h
CM4CON0_C4OUT_LENGTH                     equ 0001h
CM4CON0_C4OUT_MASK                       equ 0040h
CM4CON0_C4ON_POSN                        equ 0007h
CM4CON0_C4ON_POSITION                    equ 0007h
CM4CON0_C4ON_SIZE                        equ 0001h
CM4CON0_C4ON_LENGTH                      equ 0001h
CM4CON0_C4ON_MASK                        equ 0080h

// Register: CM4CON1
#define CM4CON1 CM4CON1
CM4CON1                                  equ 011Bh
// bitfield definitions
CM4CON1_C4NCH_POSN                       equ 0000h
CM4CON1_C4NCH_POSITION                   equ 0000h
CM4CON1_C4NCH_SIZE                       equ 0003h
CM4CON1_C4NCH_LENGTH                     equ 0003h
CM4CON1_C4NCH_MASK                       equ 0007h
CM4CON1_C4PCH_POSN                       equ 0003h
CM4CON1_C4PCH_POSITION                   equ 0003h
CM4CON1_C4PCH_SIZE                       equ 0003h
CM4CON1_C4PCH_LENGTH                     equ 0003h
CM4CON1_C4PCH_MASK                       equ 0038h
CM4CON1_C4INTN_POSN                      equ 0006h
CM4CON1_C4INTN_POSITION                  equ 0006h
CM4CON1_C4INTN_SIZE                      equ 0001h
CM4CON1_C4INTN_LENGTH                    equ 0001h
CM4CON1_C4INTN_MASK                      equ 0040h
CM4CON1_C4INTP_POSN                      equ 0007h
CM4CON1_C4INTP_POSITION                  equ 0007h
CM4CON1_C4INTP_SIZE                      equ 0001h
CM4CON1_C4INTP_LENGTH                    equ 0001h
CM4CON1_C4INTP_MASK                      equ 0080h
CM4CON1_C4NCH0_POSN                      equ 0000h
CM4CON1_C4NCH0_POSITION                  equ 0000h
CM4CON1_C4NCH0_SIZE                      equ 0001h
CM4CON1_C4NCH0_LENGTH                    equ 0001h
CM4CON1_C4NCH0_MASK                      equ 0001h
CM4CON1_C4NCH1_POSN                      equ 0001h
CM4CON1_C4NCH1_POSITION                  equ 0001h
CM4CON1_C4NCH1_SIZE                      equ 0001h
CM4CON1_C4NCH1_LENGTH                    equ 0001h
CM4CON1_C4NCH1_MASK                      equ 0002h
CM4CON1_C4NCH2_POSN                      equ 0002h
CM4CON1_C4NCH2_POSITION                  equ 0002h
CM4CON1_C4NCH2_SIZE                      equ 0001h
CM4CON1_C4NCH2_LENGTH                    equ 0001h
CM4CON1_C4NCH2_MASK                      equ 0004h
CM4CON1_C4PCH0_POSN                      equ 0003h
CM4CON1_C4PCH0_POSITION                  equ 0003h
CM4CON1_C4PCH0_SIZE                      equ 0001h
CM4CON1_C4PCH0_LENGTH                    equ 0001h
CM4CON1_C4PCH0_MASK                      equ 0008h
CM4CON1_C4PCH1_POSN                      equ 0004h
CM4CON1_C4PCH1_POSITION                  equ 0004h
CM4CON1_C4PCH1_SIZE                      equ 0001h
CM4CON1_C4PCH1_LENGTH                    equ 0001h
CM4CON1_C4PCH1_MASK                      equ 0010h
CM4CON1_C4PCH2_POSN                      equ 0005h
CM4CON1_C4PCH2_POSITION                  equ 0005h
CM4CON1_C4PCH2_SIZE                      equ 0001h
CM4CON1_C4PCH2_LENGTH                    equ 0001h
CM4CON1_C4PCH2_MASK                      equ 0020h

