GopalSaraf/Practicals/PSDL/include/proc/pic16lf1788.inc
// Register: PSMC1BLKF
#define PSMC1BLKF PSMC1BLKF
PSMC1BLKF                                equ 0EACh
// bitfield definitions
PSMC1BLKF_PSMC1BLKF0_POSN                equ 0000h
PSMC1BLKF_PSMC1BLKF0_POSITION            equ 0000h
PSMC1BLKF_PSMC1BLKF0_SIZE                equ 0001h
PSMC1BLKF_PSMC1BLKF0_LENGTH              equ 0001h
PSMC1BLKF_PSMC1BLKF0_MASK                equ 0001h
PSMC1BLKF_PSMC1BLKF1_POSN                equ 0001h
PSMC1BLKF_PSMC1BLKF1_POSITION            equ 0001h
PSMC1BLKF_PSMC1BLKF1_SIZE                equ 0001h
PSMC1BLKF_PSMC1BLKF1_LENGTH              equ 0001h
PSMC1BLKF_PSMC1BLKF1_MASK                equ 0002h
PSMC1BLKF_PSMC1BLKF2_POSN                equ 0002h
PSMC1BLKF_PSMC1BLKF2_POSITION            equ 0002h
PSMC1BLKF_PSMC1BLKF2_SIZE                equ 0001h
PSMC1BLKF_PSMC1BLKF2_LENGTH              equ 0001h
PSMC1BLKF_PSMC1BLKF2_MASK                equ 0004h
PSMC1BLKF_PSMC1BLKF3_POSN                equ 0003h
PSMC1BLKF_PSMC1BLKF3_POSITION            equ 0003h
PSMC1BLKF_PSMC1BLKF3_SIZE                equ 0001h
PSMC1BLKF_PSMC1BLKF3_LENGTH              equ 0001h
PSMC1BLKF_PSMC1BLKF3_MASK                equ 0008h
PSMC1BLKF_PSMC1BLKF4_POSN                equ 0004h
PSMC1BLKF_PSMC1BLKF4_POSITION            equ 0004h
PSMC1BLKF_PSMC1BLKF4_SIZE                equ 0001h
PSMC1BLKF_PSMC1BLKF4_LENGTH              equ 0001h
PSMC1BLKF_PSMC1BLKF4_MASK                equ 0010h
PSMC1BLKF_PSMC1BLKF5_POSN                equ 0005h
PSMC1BLKF_PSMC1BLKF5_POSITION            equ 0005h
PSMC1BLKF_PSMC1BLKF5_SIZE                equ 0001h
PSMC1BLKF_PSMC1BLKF5_LENGTH              equ 0001h
PSMC1BLKF_PSMC1BLKF5_MASK                equ 0020h
PSMC1BLKF_PSMC1BLKF6_POSN                equ 0006h
PSMC1BLKF_PSMC1BLKF6_POSITION            equ 0006h
PSMC1BLKF_PSMC1BLKF6_SIZE                equ 0001h
PSMC1BLKF_PSMC1BLKF6_LENGTH              equ 0001h
PSMC1BLKF_PSMC1BLKF6_MASK                equ 0040h
PSMC1BLKF_PSMC1BLKF7_POSN                equ 0007h
PSMC1BLKF_PSMC1BLKF7_POSITION            equ 0007h
PSMC1BLKF_PSMC1BLKF7_SIZE                equ 0001h
PSMC1BLKF_PSMC1BLKF7_LENGTH              equ 0001h
PSMC1BLKF_PSMC1BLKF7_MASK                equ 0080h

// Register: PSMC1FFA
#define PSMC1FFA PSMC1FFA
PSMC1FFA                                 equ 0EADh
// bitfield definitions
PSMC1FFA_PSMC1FFA0_POSN                  equ 0000h
PSMC1FFA_PSMC1FFA0_POSITION              equ 0000h
PSMC1FFA_PSMC1FFA0_SIZE                  equ 0001h
PSMC1FFA_PSMC1FFA0_LENGTH                equ 0001h
PSMC1FFA_PSMC1FFA0_MASK                  equ 0001h
PSMC1FFA_PSMC1FFA1_POSN                  equ 0001h
PSMC1FFA_PSMC1FFA1_POSITION              equ 0001h
PSMC1FFA_PSMC1FFA1_SIZE                  equ 0001h
PSMC1FFA_PSMC1FFA1_LENGTH                equ 0001h
PSMC1FFA_PSMC1FFA1_MASK                  equ 0002h
PSMC1FFA_PSMC1FFA2_POSN                  equ 0002h
PSMC1FFA_PSMC1FFA2_POSITION              equ 0002h
PSMC1FFA_PSMC1FFA2_SIZE                  equ 0001h
PSMC1FFA_PSMC1FFA2_LENGTH                equ 0001h
PSMC1FFA_PSMC1FFA2_MASK                  equ 0004h
PSMC1FFA_PSMC1FFA3_POSN                  equ 0003h
PSMC1FFA_PSMC1FFA3_POSITION              equ 0003h
PSMC1FFA_PSMC1FFA3_SIZE                  equ 0001h
PSMC1FFA_PSMC1FFA3_LENGTH                equ 0001h
PSMC1FFA_PSMC1FFA3_MASK                  equ 0008h

// Register: PSMC1STR0
#define PSMC1STR0 PSMC1STR0
PSMC1STR0                                equ 0EAEh
// bitfield definitions
PSMC1STR0_P1STRA_POSN                    equ 0000h
PSMC1STR0_P1STRA_POSITION                equ 0000h
PSMC1STR0_P1STRA_SIZE                    equ 0001h
PSMC1STR0_P1STRA_LENGTH                  equ 0001h
PSMC1STR0_P1STRA_MASK                    equ 0001h
PSMC1STR0_P1STRB_POSN                    equ 0001h
PSMC1STR0_P1STRB_POSITION                equ 0001h
PSMC1STR0_P1STRB_SIZE                    equ 0001h
PSMC1STR0_P1STRB_LENGTH                  equ 0001h
PSMC1STR0_P1STRB_MASK                    equ 0002h
PSMC1STR0_P1STRC_POSN                    equ 0002h
PSMC1STR0_P1STRC_POSITION                equ 0002h
PSMC1STR0_P1STRC_SIZE                    equ 0001h
PSMC1STR0_P1STRC_LENGTH                  equ 0001h
PSMC1STR0_P1STRC_MASK                    equ 0004h
PSMC1STR0_P1STRD_POSN                    equ 0003h
PSMC1STR0_P1STRD_POSITION                equ 0003h
PSMC1STR0_P1STRD_SIZE                    equ 0001h
PSMC1STR0_P1STRD_LENGTH                  equ 0001h
PSMC1STR0_P1STRD_MASK                    equ 0008h
PSMC1STR0_P1STRE_POSN                    equ 0004h
PSMC1STR0_P1STRE_POSITION                equ 0004h
PSMC1STR0_P1STRE_SIZE                    equ 0001h
PSMC1STR0_P1STRE_LENGTH                  equ 0001h
PSMC1STR0_P1STRE_MASK                    equ 0010h
PSMC1STR0_P1STRF_POSN                    equ 0005h
PSMC1STR0_P1STRF_POSITION                equ 0005h
PSMC1STR0_P1STRF_SIZE                    equ 0001h
PSMC1STR0_P1STRF_LENGTH                  equ 0001h
PSMC1STR0_P1STRF_MASK                    equ 0020h

// Register: PSMC1STR1
#define PSMC1STR1 PSMC1STR1
PSMC1STR1                                equ 0EAFh
// bitfield definitions
PSMC1STR1_P1HSMEN_POSN                   equ 0000h
PSMC1STR1_P1HSMEN_POSITION               equ 0000h
PSMC1STR1_P1HSMEN_SIZE                   equ 0001h
PSMC1STR1_P1HSMEN_LENGTH                 equ 0001h
PSMC1STR1_P1HSMEN_MASK                   equ 0001h
PSMC1STR1_P1LSMEN_POSN                   equ 0001h
PSMC1STR1_P1LSMEN_POSITION               equ 0001h
PSMC1STR1_P1LSMEN_SIZE                   equ 0001h
PSMC1STR1_P1LSMEN_LENGTH                 equ 0001h
PSMC1STR1_P1LSMEN_MASK                   equ 0002h
PSMC1STR1_P1SSYNC_POSN                   equ 0007h
PSMC1STR1_P1SSYNC_POSITION               equ 0007h
PSMC1STR1_P1SSYNC_SIZE                   equ 0001h
PSMC1STR1_P1SSYNC_LENGTH                 equ 0001h
PSMC1STR1_P1SSYNC_MASK                   equ 0080h

// Register: PSMC2CON
#define PSMC2CON PSMC2CON
PSMC2CON                                 equ 0EB1h
// bitfield definitions
PSMC2CON_P2MODE_POSN                     equ 0000h
PSMC2CON_P2MODE_POSITION                 equ 0000h
PSMC2CON_P2MODE_SIZE                     equ 0004h
PSMC2CON_P2MODE_LENGTH                   equ 0004h
PSMC2CON_P2MODE_MASK                     equ 000Fh
PSMC2CON_P2DBRE_POSN                     equ 0004h
PSMC2CON_P2DBRE_POSITION                 equ 0004h
PSMC2CON_P2DBRE_SIZE                     equ 0001h
PSMC2CON_P2DBRE_LENGTH                   equ 0001h
PSMC2CON_P2DBRE_MASK                     equ 0010h
PSMC2CON_P2DBFE_POSN                     equ 0005h
PSMC2CON_P2DBFE_POSITION                 equ 0005h
PSMC2CON_P2DBFE_SIZE                     equ 0001h
PSMC2CON_P2DBFE_LENGTH                   equ 0001h
PSMC2CON_P2DBFE_MASK                     equ 0020h
PSMC2CON_PSMC2LD_POSN                    equ 0006h
PSMC2CON_PSMC2LD_POSITION                equ 0006h
PSMC2CON_PSMC2LD_SIZE                    equ 0001h
PSMC2CON_PSMC2LD_LENGTH                  equ 0001h
PSMC2CON_PSMC2LD_MASK                    equ 0040h
PSMC2CON_PSMC2EN_POSN                    equ 0007h
PSMC2CON_PSMC2EN_POSITION                equ 0007h
PSMC2CON_PSMC2EN_SIZE                    equ 0001h
PSMC2CON_PSMC2EN_LENGTH                  equ 0001h
PSMC2CON_PSMC2EN_MASK                    equ 0080h
PSMC2CON_P2MODE0_POSN                    equ 0000h
PSMC2CON_P2MODE0_POSITION                equ 0000h
PSMC2CON_P2MODE0_SIZE                    equ 0001h
PSMC2CON_P2MODE0_LENGTH                  equ 0001h
PSMC2CON_P2MODE0_MASK                    equ 0001h
PSMC2CON_P2MODE1_POSN                    equ 0001h
PSMC2CON_P2MODE1_POSITION                equ 0001h
PSMC2CON_P2MODE1_SIZE                    equ 0001h
PSMC2CON_P2MODE1_LENGTH                  equ 0001h
PSMC2CON_P2MODE1_MASK                    equ 0002h
PSMC2CON_P2MODE2_POSN                    equ 0002h
PSMC2CON_P2MODE2_POSITION                equ 0002h
PSMC2CON_P2MODE2_SIZE                    equ 0001h
PSMC2CON_P2MODE2_LENGTH                  equ 0001h
PSMC2CON_P2MODE2_MASK                    equ 0004h
PSMC2CON_P2MODE3_POSN                    equ 0003h
PSMC2CON_P2MODE3_POSITION                equ 0003h
PSMC2CON_P2MODE3_SIZE                    equ 0001h
PSMC2CON_P2MODE3_LENGTH                  equ 0001h
PSMC2CON_P2MODE3_MASK                    equ 0008h

