GopalSaraf/Practicals/PSDL/include/proc/pic16lf1788.inc
// Register: PSMC4POL
#define PSMC4POL PSMC4POL
PSMC4POL                                 equ 0F16h
// bitfield definitions
PSMC4POL_P4POLA_POSN                     equ 0000h
PSMC4POL_P4POLA_POSITION                 equ 0000h
PSMC4POL_P4POLA_SIZE                     equ 0001h
PSMC4POL_P4POLA_LENGTH                   equ 0001h
PSMC4POL_P4POLA_MASK                     equ 0001h
PSMC4POL_P4POLB_POSN                     equ 0001h
PSMC4POL_P4POLB_POSITION                 equ 0001h
PSMC4POL_P4POLB_SIZE                     equ 0001h
PSMC4POL_P4POLB_LENGTH                   equ 0001h
PSMC4POL_P4POLB_MASK                     equ 0002h
PSMC4POL_P4INPOL_POSN                    equ 0006h
PSMC4POL_P4INPOL_POSITION                equ 0006h
PSMC4POL_P4INPOL_SIZE                    equ 0001h
PSMC4POL_P4INPOL_LENGTH                  equ 0001h
PSMC4POL_P4INPOL_MASK                    equ 0040h

// Register: PSMC4BLNK
#define PSMC4BLNK PSMC4BLNK
PSMC4BLNK                                equ 0F17h
// bitfield definitions
PSMC4BLNK_P4REBM_POSN                    equ 0000h
PSMC4BLNK_P4REBM_POSITION                equ 0000h
PSMC4BLNK_P4REBM_SIZE                    equ 0002h
PSMC4BLNK_P4REBM_LENGTH                  equ 0002h
PSMC4BLNK_P4REBM_MASK                    equ 0003h
PSMC4BLNK_P4FEBM_POSN                    equ 0004h
PSMC4BLNK_P4FEBM_POSITION                equ 0004h
PSMC4BLNK_P4FEBM_SIZE                    equ 0002h
PSMC4BLNK_P4FEBM_LENGTH                  equ 0002h
PSMC4BLNK_P4FEBM_MASK                    equ 0030h
PSMC4BLNK_P4REBM0_POSN                   equ 0000h
PSMC4BLNK_P4REBM0_POSITION               equ 0000h
PSMC4BLNK_P4REBM0_SIZE                   equ 0001h
PSMC4BLNK_P4REBM0_LENGTH                 equ 0001h
PSMC4BLNK_P4REBM0_MASK                   equ 0001h
PSMC4BLNK_P4REBM1_POSN                   equ 0001h
PSMC4BLNK_P4REBM1_POSITION               equ 0001h
PSMC4BLNK_P4REBM1_SIZE                   equ 0001h
PSMC4BLNK_P4REBM1_LENGTH                 equ 0001h
PSMC4BLNK_P4REBM1_MASK                   equ 0002h
PSMC4BLNK_P4FEBM0_POSN                   equ 0004h
PSMC4BLNK_P4FEBM0_POSITION               equ 0004h
PSMC4BLNK_P4FEBM0_SIZE                   equ 0001h
PSMC4BLNK_P4FEBM0_LENGTH                 equ 0001h
PSMC4BLNK_P4FEBM0_MASK                   equ 0010h
PSMC4BLNK_P4FEBM1_POSN                   equ 0005h
PSMC4BLNK_P4FEBM1_POSITION               equ 0005h
PSMC4BLNK_P4FEBM1_SIZE                   equ 0001h
PSMC4BLNK_P4FEBM1_LENGTH                 equ 0001h
PSMC4BLNK_P4FEBM1_MASK                   equ 0020h

// Register: PSMC4REBS
#define PSMC4REBS PSMC4REBS
PSMC4REBS                                equ 0F18h
// bitfield definitions
PSMC4REBS_P4REBSC1_POSN                  equ 0001h
PSMC4REBS_P4REBSC1_POSITION              equ 0001h
PSMC4REBS_P4REBSC1_SIZE                  equ 0001h
PSMC4REBS_P4REBSC1_LENGTH                equ 0001h
PSMC4REBS_P4REBSC1_MASK                  equ 0002h
PSMC4REBS_P4REBSC2_POSN                  equ 0002h
PSMC4REBS_P4REBSC2_POSITION              equ 0002h
PSMC4REBS_P4REBSC2_SIZE                  equ 0001h
PSMC4REBS_P4REBSC2_LENGTH                equ 0001h
PSMC4REBS_P4REBSC2_MASK                  equ 0004h
PSMC4REBS_P4REBSC3_POSN                  equ 0003h
PSMC4REBS_P4REBSC3_POSITION              equ 0003h
PSMC4REBS_P4REBSC3_SIZE                  equ 0001h
PSMC4REBS_P4REBSC3_LENGTH                equ 0001h
PSMC4REBS_P4REBSC3_MASK                  equ 0008h
PSMC4REBS_P4REBSC4_POSN                  equ 0004h
PSMC4REBS_P4REBSC4_POSITION              equ 0004h
PSMC4REBS_P4REBSC4_SIZE                  equ 0001h
PSMC4REBS_P4REBSC4_LENGTH                equ 0001h
PSMC4REBS_P4REBSC4_MASK                  equ 0010h
PSMC4REBS_P4REBSIN_POSN                  equ 0007h
PSMC4REBS_P4REBSIN_POSITION              equ 0007h
PSMC4REBS_P4REBSIN_SIZE                  equ 0001h
PSMC4REBS_P4REBSIN_LENGTH                equ 0001h
PSMC4REBS_P4REBSIN_MASK                  equ 0080h

// Register: PSMC4FEBS
#define PSMC4FEBS PSMC4FEBS
PSMC4FEBS                                equ 0F19h
// bitfield definitions
PSMC4FEBS_P4FEBSC1_POSN                  equ 0001h
PSMC4FEBS_P4FEBSC1_POSITION              equ 0001h
PSMC4FEBS_P4FEBSC1_SIZE                  equ 0001h
PSMC4FEBS_P4FEBSC1_LENGTH                equ 0001h
PSMC4FEBS_P4FEBSC1_MASK                  equ 0002h
PSMC4FEBS_P4FEBSC2_POSN                  equ 0002h
PSMC4FEBS_P4FEBSC2_POSITION              equ 0002h
PSMC4FEBS_P4FEBSC2_SIZE                  equ 0001h
PSMC4FEBS_P4FEBSC2_LENGTH                equ 0001h
PSMC4FEBS_P4FEBSC2_MASK                  equ 0004h
PSMC4FEBS_P4FEBSC3_POSN                  equ 0003h
PSMC4FEBS_P4FEBSC3_POSITION              equ 0003h
PSMC4FEBS_P4FEBSC3_SIZE                  equ 0001h
PSMC4FEBS_P4FEBSC3_LENGTH                equ 0001h
PSMC4FEBS_P4FEBSC3_MASK                  equ 0008h
PSMC4FEBS_P4FEBSC4_POSN                  equ 0004h
PSMC4FEBS_P4FEBSC4_POSITION              equ 0004h
PSMC4FEBS_P4FEBSC4_SIZE                  equ 0001h
PSMC4FEBS_P4FEBSC4_LENGTH                equ 0001h
PSMC4FEBS_P4FEBSC4_MASK                  equ 0010h
PSMC4FEBS_P4FEBSIN_POSN                  equ 0007h
PSMC4FEBS_P4FEBSIN_POSITION              equ 0007h
PSMC4FEBS_P4FEBSIN_SIZE                  equ 0001h
PSMC4FEBS_P4FEBSIN_LENGTH                equ 0001h
PSMC4FEBS_P4FEBSIN_MASK                  equ 0080h

// Register: PSMC4PHS
#define PSMC4PHS PSMC4PHS
PSMC4PHS                                 equ 0F1Ah
// bitfield definitions
PSMC4PHS_P4PHST_POSN                     equ 0000h
PSMC4PHS_P4PHST_POSITION                 equ 0000h
PSMC4PHS_P4PHST_SIZE                     equ 0001h
PSMC4PHS_P4PHST_LENGTH                   equ 0001h
PSMC4PHS_P4PHST_MASK                     equ 0001h
PSMC4PHS_P4PHSC1_POSN                    equ 0001h
PSMC4PHS_P4PHSC1_POSITION                equ 0001h
PSMC4PHS_P4PHSC1_SIZE                    equ 0001h
PSMC4PHS_P4PHSC1_LENGTH                  equ 0001h
PSMC4PHS_P4PHSC1_MASK                    equ 0002h
PSMC4PHS_P4PHSC2_POSN                    equ 0002h
PSMC4PHS_P4PHSC2_POSITION                equ 0002h
PSMC4PHS_P4PHSC2_SIZE                    equ 0001h
PSMC4PHS_P4PHSC2_LENGTH                  equ 0001h
PSMC4PHS_P4PHSC2_MASK                    equ 0004h
PSMC4PHS_P4PHSC3_POSN                    equ 0003h
PSMC4PHS_P4PHSC3_POSITION                equ 0003h
PSMC4PHS_P4PHSC3_SIZE                    equ 0001h
PSMC4PHS_P4PHSC3_LENGTH                  equ 0001h
PSMC4PHS_P4PHSC3_MASK                    equ 0008h
PSMC4PHS_P4PHSC4_POSN                    equ 0004h
PSMC4PHS_P4PHSC4_POSITION                equ 0004h
PSMC4PHS_P4PHSC4_SIZE                    equ 0001h
PSMC4PHS_P4PHSC4_LENGTH                  equ 0001h
PSMC4PHS_P4PHSC4_MASK                    equ 0010h
PSMC4PHS_P4PHSIN_POSN                    equ 0007h
PSMC4PHS_P4PHSIN_POSITION                equ 0007h
PSMC4PHS_P4PHSIN_SIZE                    equ 0001h
PSMC4PHS_P4PHSIN_LENGTH                  equ 0001h
PSMC4PHS_P4PHSIN_MASK                    equ 0080h

// Register: PSMC4DCS
#define PSMC4DCS PSMC4DCS
PSMC4DCS                                 equ 0F1Bh
// bitfield definitions
PSMC4DCS_P4DCST_POSN                     equ 0000h
PSMC4DCS_P4DCST_POSITION                 equ 0000h
PSMC4DCS_P4DCST_SIZE                     equ 0001h
PSMC4DCS_P4DCST_LENGTH                   equ 0001h
PSMC4DCS_P4DCST_MASK                     equ 0001h
PSMC4DCS_P4DCSC1_POSN                    equ 0001h
PSMC4DCS_P4DCSC1_POSITION                equ 0001h
PSMC4DCS_P4DCSC1_SIZE                    equ 0001h
PSMC4DCS_P4DCSC1_LENGTH                  equ 0001h
PSMC4DCS_P4DCSC1_MASK                    equ 0002h
PSMC4DCS_P4DCSC2_POSN                    equ 0002h
PSMC4DCS_P4DCSC2_POSITION                equ 0002h
PSMC4DCS_P4DCSC2_SIZE                    equ 0001h
PSMC4DCS_P4DCSC2_LENGTH                  equ 0001h
PSMC4DCS_P4DCSC2_MASK                    equ 0004h
PSMC4DCS_P4DCSC3_POSN                    equ 0003h
PSMC4DCS_P4DCSC3_POSITION                equ 0003h
PSMC4DCS_P4DCSC3_SIZE                    equ 0001h
PSMC4DCS_P4DCSC3_LENGTH                  equ 0001h
PSMC4DCS_P4DCSC3_MASK                    equ 0008h
PSMC4DCS_P4DCSC4_POSN                    equ 0004h
PSMC4DCS_P4DCSC4_POSITION                equ 0004h
PSMC4DCS_P4DCSC4_SIZE                    equ 0001h
PSMC4DCS_P4DCSC4_LENGTH                  equ 0001h
PSMC4DCS_P4DCSC4_MASK                    equ 0010h
PSMC4DCS_P4DCSIN_POSN                    equ 0007h
PSMC4DCS_P4DCSIN_POSITION                equ 0007h
PSMC4DCS_P4DCSIN_SIZE                    equ 0001h
PSMC4DCS_P4DCSIN_LENGTH                  equ 0001h
PSMC4DCS_P4DCSIN_MASK                    equ 0080h

// Register: PSMC4PRS
#define PSMC4PRS PSMC4PRS
PSMC4PRS                                 equ 0F1Ch
// bitfield definitions
PSMC4PRS_P4PRST_POSN                     equ 0000h
PSMC4PRS_P4PRST_POSITION                 equ 0000h
PSMC4PRS_P4PRST_SIZE                     equ 0001h
PSMC4PRS_P4PRST_LENGTH                   equ 0001h
PSMC4PRS_P4PRST_MASK                     equ 0001h
PSMC4PRS_P4PRSC1_POSN                    equ 0001h
PSMC4PRS_P4PRSC1_POSITION                equ 0001h
PSMC4PRS_P4PRSC1_SIZE                    equ 0001h
PSMC4PRS_P4PRSC1_LENGTH                  equ 0001h
PSMC4PRS_P4PRSC1_MASK                    equ 0002h
PSMC4PRS_P4PRSC2_POSN                    equ 0002h
PSMC4PRS_P4PRSC2_POSITION                equ 0002h
PSMC4PRS_P4PRSC2_SIZE                    equ 0001h
PSMC4PRS_P4PRSC2_LENGTH                  equ 0001h
PSMC4PRS_P4PRSC2_MASK                    equ 0004h
PSMC4PRS_P4PRSC3_POSN                    equ 0003h
PSMC4PRS_P4PRSC3_POSITION                equ 0003h
PSMC4PRS_P4PRSC3_SIZE                    equ 0001h
PSMC4PRS_P4PRSC3_LENGTH                  equ 0001h
PSMC4PRS_P4PRSC3_MASK                    equ 0008h
PSMC4PRS_P4PRSC4_POSN                    equ 0004h
PSMC4PRS_P4PRSC4_POSITION                equ 0004h
PSMC4PRS_P4PRSC4_SIZE                    equ 0001h
PSMC4PRS_P4PRSC4_LENGTH                  equ 0001h
PSMC4PRS_P4PRSC4_MASK                    equ 0010h
PSMC4PRS_P4PRSIN_POSN                    equ 0007h
PSMC4PRS_P4PRSIN_POSITION                equ 0007h
PSMC4PRS_P4PRSIN_SIZE                    equ 0001h
PSMC4PRS_P4PRSIN_LENGTH                  equ 0001h
PSMC4PRS_P4PRSIN_MASK                    equ 0080h

// Register: PSMC4ASDC
#define PSMC4ASDC PSMC4ASDC
PSMC4ASDC                                equ 0F1Dh
// bitfield definitions
PSMC4ASDC_P4ASDOV_POSN                   equ 0000h
PSMC4ASDC_P4ASDOV_POSITION               equ 0000h
PSMC4ASDC_P4ASDOV_SIZE                   equ 0001h
PSMC4ASDC_P4ASDOV_LENGTH                 equ 0001h
PSMC4ASDC_P4ASDOV_MASK                   equ 0001h
PSMC4ASDC_P4ARSEN_POSN                   equ 0005h
PSMC4ASDC_P4ARSEN_POSITION               equ 0005h
PSMC4ASDC_P4ARSEN_SIZE                   equ 0001h
PSMC4ASDC_P4ARSEN_LENGTH                 equ 0001h
PSMC4ASDC_P4ARSEN_MASK                   equ 0020h
PSMC4ASDC_P4ASDEN_POSN                   equ 0006h
PSMC4ASDC_P4ASDEN_POSITION               equ 0006h
PSMC4ASDC_P4ASDEN_SIZE                   equ 0001h
PSMC4ASDC_P4ASDEN_LENGTH                 equ 0001h
PSMC4ASDC_P4ASDEN_MASK                   equ 0040h
PSMC4ASDC_P4ASE_POSN                     equ 0007h
PSMC4ASDC_P4ASE_POSITION                 equ 0007h
PSMC4ASDC_P4ASE_SIZE                     equ 0001h
PSMC4ASDC_P4ASE_LENGTH                   equ 0001h
PSMC4ASDC_P4ASE_MASK                     equ 0080h

// Register: PSMC4ASDL
#define PSMC4ASDL PSMC4ASDL
PSMC4ASDL                                equ 0F1Eh
// bitfield definitions
PSMC4ASDL_P4ASDLA_POSN                   equ 0000h
PSMC4ASDL_P4ASDLA_POSITION               equ 0000h
PSMC4ASDL_P4ASDLA_SIZE                   equ 0001h
PSMC4ASDL_P4ASDLA_LENGTH                 equ 0001h
PSMC4ASDL_P4ASDLA_MASK                   equ 0001h
PSMC4ASDL_P4ASDLB_POSN                   equ 0001h
PSMC4ASDL_P4ASDLB_POSITION               equ 0001h
PSMC4ASDL_P4ASDLB_SIZE                   equ 0001h
PSMC4ASDL_P4ASDLB_LENGTH                 equ 0001h
PSMC4ASDL_P4ASDLB_MASK                   equ 0002h

// Register: PSMC4ASDS
#define PSMC4ASDS PSMC4ASDS
PSMC4ASDS                                equ 0F1Fh
// bitfield definitions
PSMC4ASDS_P4ASDSC1_POSN                  equ 0001h
PSMC4ASDS_P4ASDSC1_POSITION              equ 0001h
PSMC4ASDS_P4ASDSC1_SIZE                  equ 0001h
PSMC4ASDS_P4ASDSC1_LENGTH                equ 0001h
PSMC4ASDS_P4ASDSC1_MASK                  equ 0002h
PSMC4ASDS_P4ASDSC2_POSN                  equ 0002h
PSMC4ASDS_P4ASDSC2_POSITION              equ 0002h
PSMC4ASDS_P4ASDSC2_SIZE                  equ 0001h
PSMC4ASDS_P4ASDSC2_LENGTH                equ 0001h
PSMC4ASDS_P4ASDSC2_MASK                  equ 0004h
PSMC4ASDS_P4ASDSC3_POSN                  equ 0003h
PSMC4ASDS_P4ASDSC3_POSITION              equ 0003h
PSMC4ASDS_P4ASDSC3_SIZE                  equ 0001h
PSMC4ASDS_P4ASDSC3_LENGTH                equ 0001h
PSMC4ASDS_P4ASDSC3_MASK                  equ 0008h
PSMC4ASDS_P4ASDSC4_POSN                  equ 0004h
PSMC4ASDS_P4ASDSC4_POSITION              equ 0004h
PSMC4ASDS_P4ASDSC4_SIZE                  equ 0001h
PSMC4ASDS_P4ASDSC4_LENGTH                equ 0001h
PSMC4ASDS_P4ASDSC4_MASK                  equ 0010h
PSMC4ASDS_P4ASDSIN_POSN                  equ 0007h
PSMC4ASDS_P4ASDSIN_POSITION              equ 0007h
PSMC4ASDS_P4ASDSIN_SIZE                  equ 0001h
PSMC4ASDS_P4ASDSIN_LENGTH                equ 0001h
PSMC4ASDS_P4ASDSIN_MASK                  equ 0080h

