GopalSaraf/Practicals/PSDL/include/proc/pic16lf1788.inc
// Register: PSMC4BLKF
#define PSMC4BLKF PSMC4BLKF
PSMC4BLKF                                equ 0F2Ch
// bitfield definitions
PSMC4BLKF_PSMC4BLKF0_POSN                equ 0000h
PSMC4BLKF_PSMC4BLKF0_POSITION            equ 0000h
PSMC4BLKF_PSMC4BLKF0_SIZE                equ 0001h
PSMC4BLKF_PSMC4BLKF0_LENGTH              equ 0001h
PSMC4BLKF_PSMC4BLKF0_MASK                equ 0001h
PSMC4BLKF_PSMC4BLKF1_POSN                equ 0001h
PSMC4BLKF_PSMC4BLKF1_POSITION            equ 0001h
PSMC4BLKF_PSMC4BLKF1_SIZE                equ 0001h
PSMC4BLKF_PSMC4BLKF1_LENGTH              equ 0001h
PSMC4BLKF_PSMC4BLKF1_MASK                equ 0002h
PSMC4BLKF_PSMC4BLKF2_POSN                equ 0002h
PSMC4BLKF_PSMC4BLKF2_POSITION            equ 0002h
PSMC4BLKF_PSMC4BLKF2_SIZE                equ 0001h
PSMC4BLKF_PSMC4BLKF2_LENGTH              equ 0001h
PSMC4BLKF_PSMC4BLKF2_MASK                equ 0004h
PSMC4BLKF_PSMC4BLKF3_POSN                equ 0003h
PSMC4BLKF_PSMC4BLKF3_POSITION            equ 0003h
PSMC4BLKF_PSMC4BLKF3_SIZE                equ 0001h
PSMC4BLKF_PSMC4BLKF3_LENGTH              equ 0001h
PSMC4BLKF_PSMC4BLKF3_MASK                equ 0008h
PSMC4BLKF_PSMC4BLKF4_POSN                equ 0004h
PSMC4BLKF_PSMC4BLKF4_POSITION            equ 0004h
PSMC4BLKF_PSMC4BLKF4_SIZE                equ 0001h
PSMC4BLKF_PSMC4BLKF4_LENGTH              equ 0001h
PSMC4BLKF_PSMC4BLKF4_MASK                equ 0010h
PSMC4BLKF_PSMC4BLKF5_POSN                equ 0005h
PSMC4BLKF_PSMC4BLKF5_POSITION            equ 0005h
PSMC4BLKF_PSMC4BLKF5_SIZE                equ 0001h
PSMC4BLKF_PSMC4BLKF5_LENGTH              equ 0001h
PSMC4BLKF_PSMC4BLKF5_MASK                equ 0020h
PSMC4BLKF_PSMC4BLKF6_POSN                equ 0006h
PSMC4BLKF_PSMC4BLKF6_POSITION            equ 0006h
PSMC4BLKF_PSMC4BLKF6_SIZE                equ 0001h
PSMC4BLKF_PSMC4BLKF6_LENGTH              equ 0001h
PSMC4BLKF_PSMC4BLKF6_MASK                equ 0040h
PSMC4BLKF_PSMC4BLKF7_POSN                equ 0007h
PSMC4BLKF_PSMC4BLKF7_POSITION            equ 0007h
PSMC4BLKF_PSMC4BLKF7_SIZE                equ 0001h
PSMC4BLKF_PSMC4BLKF7_LENGTH              equ 0001h
PSMC4BLKF_PSMC4BLKF7_MASK                equ 0080h

// Register: PSMC4FFA
#define PSMC4FFA PSMC4FFA
PSMC4FFA                                 equ 0F2Dh
// bitfield definitions
PSMC4FFA_PSMC4FFA0_POSN                  equ 0000h
PSMC4FFA_PSMC4FFA0_POSITION              equ 0000h
PSMC4FFA_PSMC4FFA0_SIZE                  equ 0001h
PSMC4FFA_PSMC4FFA0_LENGTH                equ 0001h
PSMC4FFA_PSMC4FFA0_MASK                  equ 0001h
PSMC4FFA_PSMC4FFA1_POSN                  equ 0001h
PSMC4FFA_PSMC4FFA1_POSITION              equ 0001h
PSMC4FFA_PSMC4FFA1_SIZE                  equ 0001h
PSMC4FFA_PSMC4FFA1_LENGTH                equ 0001h
PSMC4FFA_PSMC4FFA1_MASK                  equ 0002h
PSMC4FFA_PSMC4FFA2_POSN                  equ 0002h
PSMC4FFA_PSMC4FFA2_POSITION              equ 0002h
PSMC4FFA_PSMC4FFA2_SIZE                  equ 0001h
PSMC4FFA_PSMC4FFA2_LENGTH                equ 0001h
PSMC4FFA_PSMC4FFA2_MASK                  equ 0004h
PSMC4FFA_PSMC4FFA3_POSN                  equ 0003h
PSMC4FFA_PSMC4FFA3_POSITION              equ 0003h
PSMC4FFA_PSMC4FFA3_SIZE                  equ 0001h
PSMC4FFA_PSMC4FFA3_LENGTH                equ 0001h
PSMC4FFA_PSMC4FFA3_MASK                  equ 0008h

// Register: PSMC4STR0
#define PSMC4STR0 PSMC4STR0
PSMC4STR0                                equ 0F2Eh
// bitfield definitions
PSMC4STR0_P4STRA_POSN                    equ 0000h
PSMC4STR0_P4STRA_POSITION                equ 0000h
PSMC4STR0_P4STRA_SIZE                    equ 0001h
PSMC4STR0_P4STRA_LENGTH                  equ 0001h
PSMC4STR0_P4STRA_MASK                    equ 0001h
PSMC4STR0_P4STRB_POSN                    equ 0001h
PSMC4STR0_P4STRB_POSITION                equ 0001h
PSMC4STR0_P4STRB_SIZE                    equ 0001h
PSMC4STR0_P4STRB_LENGTH                  equ 0001h
PSMC4STR0_P4STRB_MASK                    equ 0002h

// Register: PSMC4STR1
#define PSMC4STR1 PSMC4STR1
PSMC4STR1                                equ 0F2Fh
// bitfield definitions
PSMC4STR1_P4HSMEN_POSN                   equ 0000h
PSMC4STR1_P4HSMEN_POSITION               equ 0000h
PSMC4STR1_P4HSMEN_SIZE                   equ 0001h
PSMC4STR1_P4HSMEN_LENGTH                 equ 0001h
PSMC4STR1_P4HSMEN_MASK                   equ 0001h
PSMC4STR1_P4LSMEN_POSN                   equ 0001h
PSMC4STR1_P4LSMEN_POSITION               equ 0001h
PSMC4STR1_P4LSMEN_SIZE                   equ 0001h
PSMC4STR1_P4LSMEN_LENGTH                 equ 0001h
PSMC4STR1_P4LSMEN_MASK                   equ 0002h
PSMC4STR1_P4SSYNC_POSN                   equ 0007h
PSMC4STR1_P4SSYNC_POSITION               equ 0007h
PSMC4STR1_P4SSYNC_SIZE                   equ 0001h
PSMC4STR1_P4SSYNC_LENGTH                 equ 0001h
PSMC4STR1_P4SSYNC_MASK                   equ 0080h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0FE4h
// bitfield definitions
STATUS_SHAD_C_SHAD_POSN                  equ 0000h
STATUS_SHAD_C_SHAD_POSITION              equ 0000h
STATUS_SHAD_C_SHAD_SIZE                  equ 0001h
STATUS_SHAD_C_SHAD_LENGTH                equ 0001h
STATUS_SHAD_C_SHAD_MASK                  equ 0001h
STATUS_SHAD_DC_SHAD_POSN                 equ 0001h
STATUS_SHAD_DC_SHAD_POSITION             equ 0001h
STATUS_SHAD_DC_SHAD_SIZE                 equ 0001h
STATUS_SHAD_DC_SHAD_LENGTH               equ 0001h
STATUS_SHAD_DC_SHAD_MASK                 equ 0002h
STATUS_SHAD_Z_SHAD_POSN                  equ 0002h
STATUS_SHAD_Z_SHAD_POSITION              equ 0002h
STATUS_SHAD_Z_SHAD_SIZE                  equ 0001h
STATUS_SHAD_Z_SHAD_LENGTH                equ 0001h
STATUS_SHAD_Z_SHAD_MASK                  equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0005h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0005h
BSR_SHAD_BSR_SHAD_MASK                   equ 001Fh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 0FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0007h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0007h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 007Fh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 0FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 0FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 0FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 0FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FEDh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh

